In [17]:
#%pip install mysql-connector-python
#%pip install pymysql
import mysql.connector as conn
import pandas as pd
from sqlalchemy import create_engine

## Creamos la conexión con nuestra base de datos

In [13]:
conexion = conn.connect(host='localhost',  
                       user='root',        
                       passwd='password', 
                       )

cursor = conexion.cursor()

In [14]:
str_conn = 'mysql+pymysql://root:password@localhost:3306/movies'

cursor = create_engine(str_conn)

## La primera query es para conocer cuál es la película es mas rentada, para ello relacionamos la tabla 'film' con la tabla 'inventory' y a su vez con la tabla 'rental'.

In [15]:
query = '''
SELECT f.title AS pelicula_mas_rentada, COUNT(rental_id) AS veces_rentada
FROM film f
INNER JOIN inventory i ON f.film_id = i.film_id
INNER JOIN rental r ON i.inventory_id = r.inventory_id
GROUP BY f.title
ORDER BY veces_rentada DESC
;
'''


datos = pd.read_sql(query, cursor)

datos.head()

  pelicula_mas_rentada  veces_rentada
0        BOOGIE AMELIE              4
1          CLOSER BANG              3
2       BINGO TALENTED              3
3   BUCKET BROTHERHOOD              3
4          ANTHEM LUKE              3

## La segunda query es para conocer el día de la semana que mas alquileres se realizan. Para ello seleccionamos 'day_of_week' de la tabla 'rental', hacemos un count y agrupamos por día de semana. Tenemos que el día que mas se rentan películas es el sábado

In [16]:
query = '''

SELECT day_of_week, COUNT(*) AS total_rentals   
FROM rental
GROUP BY day_of_week
ORDER BY total_rentals DESC

;
'''


datos = pd.read_sql(query, cursor)

datos.head()

  day_of_week  total_rentals
0    Saturday            196
1    Thursday            174
2      Friday            166
3      Monday            158
4      Sunday            154

## Para conocer el tipo de rating mas visto, seleccionamos la columna 'rating' de la tabla 'film', hacemos un count, aprupamos y tenemos que la mas vista es la clasificación PG-13 con supervisión de los padres para menores de 13 años

In [18]:
query = '''
SELECT rating, COUNT(*) AS total_vistas
FROM film
GROUP BY rating
ORDER BY total_vistas DESC
;
'''


datos = pd.read_sql(query, cursor)

datos.head()

  rating  total_vistas
0  PG-13           223
1  NC-17           210
2      R           195
3     PG           194
4      G           178

## Para conocer la cantidad de películas rentadas por categorías, seleccionamos la tabla 'film' hacemos un inner join con la tabla 'category' para tener las categorías, luego juntamos con 'inventory' y  'rental', agrupamos por categoría y hacemos un count en los registros de 'rental_id'. Obtuvimos que Documentary es la categoría de películas que mas rentan.

In [19]:
query = '''
SELECT o.category AS category, COUNT(rental_id) AS veces_rentada
FROM film f
INNER JOIN old_hdd o ON f.title = o.title
INNER JOIN inventory i ON f.film_id = i.film_id
INNER JOIN rental r ON i.inventory_id = r.inventory_id
GROUP BY o.category
ORDER BY veces_rentada DESC;
'''


datos = pd.read_sql(query, cursor)

datos.head()

      category  veces_rentada
0  Documentary             28
1        Drama             23
2          New             21
3      Foreign             19
4       Action             19

## Quería conocer el total de dinero obtenido de rentas de películas los días sábados. Para ello junté la tabla 'film' con la tabla de 'inventory' y a su vez con la tabla 'rental'. Sumé la columna de 'rental_rate' que contiene el precio de alquiler de una película y coloqué un where para que solamente tomara los registros de los días sábados.

In [22]:
query = '''
SELECT SUM(f.rental_rate) AS total_rental_earnings
FROM film f
INNER JOIN inventory i ON f.film_id = i.film_id
INNER JOIN rental r ON i.inventory_id = r.inventory_id
WHERE day_of_week = 'Saturday'
'''


datos = pd.read_sql(query, cursor)

datos.head()

   total_rental_earnings
0                 458.28